tap "romkatv/powerlevel10k"       ## plugin theme of the p10k
brew "bat"                        ## customize command the bat
brew "chezmoi"                    ## manage dotfiles
brew "eza"                        ## customize command the ls
brew "fd"                         ## customize command the find
brew "fzf"                        ## fuzzy search of finder
brew "gh"                         ## cli the github
brew "ghq"                        ## manage repository
brew "git"                        ## cli the git
brew "jq"                         ## format the json
brew "mise"                       ## manage node version
brew "npm-check-updates"          ## npm check updates
brew "neovim"                     ## customize command the vim
brew "pnpm"                       ## customize npm
brew "powerlevel10k"              ## customize terminal
brew "ripgrep"                    ## customize command the grep
brew "sshs"                       ## ~/.ssh/config check
brew "tree"                       ## check directory tree
brew "tree-sitter"                ## parser generator, incremental analysis library
brew "zoxide"                     ## customize command the cd
brew "zsh-syntax-highlighting"    ## zsh: syntax highlight
brew "zsh-autosuggestions"        ## zsh: auto suggest
brew "zsh-completions"            ## zsh: completion

# cask "alfred"
# cask "alt-tab"
# cask "antigravity"
# cask "appcleaner"
# cask "chatgpt-atlas"
cask "claude"
cask "claude-code"
# cask "cursor"
# cask "firefox"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-source-han-code-jp"
cask "ghostty"
cask "google-chrome"
# cask "karabiner-elements"
# cask "microsoft-edge"
cask "numi"
cask "raycast"
# cask "rectangle"
# cask "slack"
cask "visual-studio-code"
# cask "visual-studio-code@insiders"
cask "zed"
